[{"name":"AngularJS","code":"angular","type":"skill","enabled":"true","percentage":"80","category":"frameworks","since":2015,"description":"AngularJS was my goto front-end framework for a long time. This website is built with AngularJS. The crown-jewel of my AngularJS experience is found at <a href='https://design.imprintplus.com' target='_blank'>https://design.imprintplus.com</a>, a web app where high profile customers such as Hudson Bay Company, 7-Eleven and Best Buy go to design and print their name badges and <a href='https://design.imprintplus.com' target='_blank'>https://design.imprintplus.com</a>, a web app based on NPG cloud but embedded into an e-store.","tldr":"","image":"angular.png"},{"name":"React","code":"react","type":"skill","enabled":"true","percentage":"90","category":"frameworks","since":2021,"description":"I learned React during my tenure at VINN. Having previous knowledge with of the AngularJs framework definitely helped in developing my skills with React. I've been especially fond of Redux and Material UI to use in conjunction with the framework.","tldr":"","image":"react.png"},{"name":"Ruby on Rails","code":"rails","type":"skill","enabled":"true","percentage":"90","category":"frameworks","since":2021,"description":"I've been quickly becoming more adept at Ruby on Rails have been thrown into developing an existing website at <a href='vinnauto.com' target='_blank'>VINN</a>. I have been quite blown away by it's simplicity and will probably be using it moving forward to develop in the future. I am currently planning on moving my popular trivia chatbot to Rails","tldr":"","image":"rails.png"},{"name":"Firebase","code":"firebase","type":"skill","enabled":"false","percentage":"60","category":"platforms","since":2018,"description":"My knowledge with firebase currently extends to the login functionality on this site. That being said, don't hesitate to give the login a whirl. The chat under the 'Contact' heading will become usable once you login.","tldr":"","image":"firebase.png"},{"name":"NodeJS","code":"node","type":"skill","enabled":"true","percentage":"80","category":"platforms","since":2015,"description":"I discovered Node and started learning its possibilities in June 2015. The simplicity to set up a running server with Node is quite frankly astonishing and the ease of adding community written plugins still amazes me on a daily basis. Currently I have 4 node apps running, 2 externally facing that have helped me automate various processes, including an app that made it possible to download software previously only available via CD.<br>I've used a lot of plugins so far, the most notable ones would be: <ul><li><strong>Tedious</strong> To make SQL connections easy</li><li><strong>Sequelize</strong> To make SQL queries using JS syntax</li><li><strong>Mongoose</strong> To make query MongoDB</li><li><strong>IIS Node</strong> To run node apps in IIS</li><li><strong>Nodemailer</strong> Simple SMTP package to make mailing easy</li><li><strong>Gulp</strong> To make development a breeze</li></ul>A full mastery of Node is impossible; I learn new things every time I use it and I am eager to keep learning it.","tldr":"","image":"node.png"},{"name":"French","code":"fr","type":"language","enabled":"true","percentage":"80","category":"languages","since":1992,"description":"Growing up in a small bilingual country with a non-common mother tongue, getting a second language is mandatory. By 12th grade we were required to read novels and do book reports, debate with classmates on various subjects and do an oral exam. Even though at the time it didn't seem like a great thing, I later landed a job for Nestle tech support (HP) in Dublin which only served French-speaking users while all my colleagues were also French. Crazily enough, I learned a vast amount of technical and colloquial French in an English speaking country. This skill comes in very handy in Canada as I can write manuals and user interfaces in both official languages (and which I am not a stranger too). Although I am getting rustier again at French due to not having used it in a while, it still comes in handy when a French-speaking customer is having trouble.","tldr":"","image":"france.png"},{"name":"Dutch","code":"nl","type":"language","enabled":"true","percentage":"100","category":"languages","since":1988,"description":"Although my mother tongue is <a href='https://en.wikipedia.org/wiki/West_Flemish' target='_blank'>West-Flemish</a>, Dutch is basically a second mother tongue to me due to the closeness of the languages and having to speak Dutch to the rest of the Flemish and Dutch population so they could understand us. I've used this asset to translate software I've made that is sold to Dutch customers currently.","tldr":"","image":"netherlands.png"},{"name":"MSSQL","code":"sql","type":"skill","enabled":"true","percentage":"85","category":"databases","since":2012,"description":"SQL Server is one of the environments I'm most comfortable in. I have been able to use SQL server to automate a plethora of processes saving countless hours of manual work and weeding out errors made by it: automating emailed orders, calling APIs to auto-process orders, getting form data from wordpress, adding tarriffed item counts to UPS labels, calculating US customs dues, sending packing slips to third party warehouses, auto-enrolling supply chain customers,.... I've received a substantial <strong>CEO award</strong> in 2015 for building a report that allowed users to correlate any 2 attributes of sales to show trending. I've set up a couple of SQL databases from scratch to use for various reasons: APIs, SSRS reporting cubes, Automated order processing and am savvy in creating all aspects of a new database (keys, procedures, functions, relationships, backups, jobs,...)","tldr":"","image":"sql.png"},{"name":"Sequelize","code":"sequelize","type":"tool","enabled":"false","percentage":"80","category":"libraries","since":2016,"description":"I first found Sequelize in the beginning of 2017 as I was searching for a tool to make SQL querying easier and making SQL injection hard. I stumbled upon Sequelize and have since implemented it in practically all my node apps. Since I'm know my way around SQL and I'm very accustomed to javascript syntax, this tool just married both into a fantastic tool to speed up all coding related to SQL.","tldr":"","image":"sequelize.png"},{"name":"ASP.NET","code":"asp","type":"skill","enabled":"false","percentage":"65","category":"coding","description":"My experience with ASP has mostly been making one page applications like <a href='http://nameprintgraphics.com/npgjava/bb' target='_blank'>Best Buy Badges</a> or building on existing ASP applications like <a href='http://registration.imprintplus.com' target='_blank'>the Logic Protect Registration server</a>. Although I favor Node and PHP, I'm capable of building ASP applications.","since":2013,"image":"aspnet.png"},{"name":"JQuery","code":"jquery","type":"skill","enabled":"false","percentage":"99","category":"libraries","description":"There's really no starting any web development without JQuery from my point of view. Eliminating the verbose Document statements and adding easy css manipulations are a no-brainer. It's also very hard to be bad at JQuery since it's so easy to use. Anyway, if you're reading this, I'm sure I don't need to explain it any further.","since":2012,"image":"jquery.png"},{"name":"Java","code":"java","type":"skill","enabled":"true","percentage":"65","category":"coding","description":"My most extensive experiences with Java are my thesis in college <a href='http://simplegamenet.sourceforge.net' target='_blank'>SimpleGameNet</a> and doing bug fixes on name badge design applet that I eventually replaced with a MEAN stack app. It was a no brainer for my thesis as the purpose was to make a gaming network to could run on different operating systems. I've worked with Netbeans and practically all java versions since 1.4. Java is undebiably useful due to it's cross-OS compatibility although I've left it a bit by the wayside due to my focus on web technologies and [web] Java support disappearing.","tldr":"A bit rusty but worked with it closely","since":2002,"image":"java.png"},{"name":"PostgreSQL","code":"postgresql","type":"skill","enabled":"true","percentage":"85","category":"databases","description":"Postgres was the only database I used while working at VINN. I was able to tap into my existing knowledge of MSSQL to quickly get up to speed. I mentored some of the younger devs in SQL and encouraged them to explore the data through PGAdmin.","image":"postgresql.png"},{"name":"Certifications","code":"certify","type":"skill","enabled":"false","percentage":"85","category":"misc","description":"I've certified a plethora of different software applications using various certificates: websites (Node and IIS), EXEs, MSIs, DLLs, JARs with PFX and EV certifications, self-signed or provided by Symantec.","image":"certified.png"},{"name":"Google API","code":"googleapi","type":"skill","enabled":"false","percentage":"60","category":"tools","description":"I've used the Google Developer Console to dynamically load Youtube videos, create smooth maps, add funky fonts, analyze visitor data and add recaptchas to sites. There is a vast amount of resources available there and I've just scratched the surface of them. Undoubtedly I will continue using Google's APIs.","image":"google.png"},{"name":"Redis","code":"redis","type":"skill","enabled":"false","percentage":"80","category":"tools","description":"I can't imagine a modern web app not using redis at this point. I've used it to queue chat messages, prevent race conditions, create delayed tasks, keep track of chat timeouts, etc...","image":"redis.png"},{"name":"AWS","code":"aws","type":"skill","enabled":"true","percentage":"75","category":"platforms","description":"There is so much to learn in AWS it's hard to gauge how good you are at it. Tools I've used within it: S3, EC2, IAM, CloudFront, CodePipeline, CodeDeploy, Route 53, Lambda & Elastic Beanstalk ","image":"aws.jpg"},{"name":"MS IIS","code":"iis","type":"skill","enabled":"false","percentage":"75","category":"tools","since":1999,"description":"I've maintained multiple different websites in IIS including a server which had PHP, ASP and Node (IIS Node) websites runnning concurrently. I'm no stranger to setting up SSL certificates, redirects, web.config files, APIs (WebDAV FTL) and managing the appropriate permissions for app pools and users. Although I have set up a bunch of sites already, there is still much to learn in IIS.","tldr":"","image":"iis.png"},{"name":"MongoDB","code":"mongo","type":"skill","enabled":"true","percentage":"85","category":"databases","since":2015,"description":"Currently Mongo is the only No-SQL database language I've ever used (both the local installation administered with Robomongo and one hosted by Mongolab). I've used it together with Mongoose in node. Although I do see the benefits of fast data access with documents, I still prefer the robust nature of a SQL relational database. However, the speed at which you can set up a No-SQL database is my biggest draw.","image":"mongodb.png"},{"name":"C++","code":"c++","type":"skill","enabled":"true","percentage":"40","category":"coding","since":2000,"description":"Back in college I wrote C++ applications (2000-2003) but there was a hiatus of over a decade before I dove into it again by adding features and fixing bugs of an existing application. I wouldn't call myself an expert in C++ but having dived back into it, it has really shown that it is like riding a bike, give or take some maintenance.","image":"c++.png"},{"name":"MS Dynamics 365","code":"crm","type":"skill","enabled":"false","percentage":"70","category":"platforms","description":"I've worked with Dynamics extensively but mostly from a backend perspective. I've set up syncs between CRM and NAV, creating datacubes from them for reporting, set up elaborate workflows with the UI and administered permissions. I also spun up test environments for both numerous times.","image":"msdynamics.png"},{"name":"HTML5","code":"html5","type":"skill","description":"","category":"coding","image":"html5.png"},{"name":"Git","code":"git","type":"skill","enabled":"true","percentage":"85","category":"tools","since":2015,"description":"I've worked with SVN before, but in my eyes, it is no match with Git. There simply is no project I will start without Git. I've used it to create repositories for all code at Imprint Plus (with Atlassian BitBucket) as previously the code was all over the place without a central location.","image":"git.png"},{"name":"Atom","code":"atom","type":"tool","enabled":"false","percentage":"100","category":"tools","since":2015,"description":"My go-to text editor to code web apps in. The community-driven list of plugins is endless and it works like magic in conjunction with Git. Some plugins I particularly enjoyed are: <ul><li>minimap</li><li>linter</li><li>jshint</li><li>autoclose-html</li><li>pigments</li><li>highlight-selected</li></ul>","image":"atom.png"},{"name":"VS Code","code":"vscode","type":"tool","enabled":"true","percentage":"100","category":"tools","since":2020,"description":"My new go-to text editor to code web apps in. The code-pilot feature is particularly mind-blowing to me.","image":"vscode.png"},{"name":"Bootstrap","code":"bootstrap","type":"skill","enabled":"false","percentage":"95","category":"libraries","since":2012,"description":"It is undeniable how convenient and smooth Bootstrap is and how easily you can plop in different themes. If I have to make a quick web app or I'm making an elaborate website, bootstrap is the first thing in the resource folder. Clikc change theme in this website to see just how easy it is to switch.","image":"bootstrap.png"},{"name":"NextJs","code":"nextjs","type":"skill","enabled":"true","percentage":"75","category":"frameworks","since":2022,"description":"NextJs has been a very powerful tool to bring SSR to React, I've decided to move forward using it in my next projects as it combines the convenience of react with the power of the server.","image":"nextjs.png"},{"name":"Express","code":"express","type":"skill","enabled":"true","percentage":"95","category":"frameworks","since":2015,"description":"My go to for building RESTful APIs before I discovered Rails. I have thoroughly enjoyed building APIs with express however. I like that it's easily customizable and that I can use it in a matter of minutes.","image":"express.png"},{"name":"Cypress","code":"cypress","type":"skill","enabled":"true","percentage":"80","category":"testing","since":2021,"description":"Although I don't necessarily love Cypress, I am quite amazed sometimes at seeing it click through the application you made while keeping your fingers crossed it won't flake out. I've used it on all frontend development in my position at VINN.","image":"cypress.jpg"},{"name":"Jest","code":"jest","type":"skill","enabled":"true","percentage":"90","category":"testing","since":2021,"description":"Of all the testing frameworks, I most liked working with Jest. It actually allowed me to easily be creative with all possible scenarios of functional Javascript testing.","image":"jest.png"},{"name":"RSpec","code":"rspec","type":"skill","enabled":"true","percentage":"80","category":"testing","since":2021,"description":"I've used Rspec on all levels of my development in Ruby On Rails, practically every file had an equivalent test file asociated with; a standard we kept high among all backend developers. I've used it in conjunction with Rswag which can build API documentation as well as fully test your rails developed API.","image":"rspec.png"},{"name":"Javascript","code":"js","type":"skill","enabled":"true","percentage":"95","category":"coding","since":2001,"description":"Due to its ease of use, javascript is my go-to language for most solutions. I've used it to make easy URL builders, file matching, ftp transactions, dynamic intranet pages, CRM automation, search functions, online coding challenges, and numerous other things to quickly help out people. It is essential when making sites and combined with Node it truly becomes a powerhouse for which you only have to know one language.","image":"js.png"},{"name":"Visual Studio","code":"vs","type":"tool","enabled":"true","percentage":"70","category":"tools","since":2001,"description":"I've used Visual Studio for a long time for both SSRS reporting, C++ and Visual Basic programming projects. Like all Microsoft products, it is so feature rich that you can get lost in it easily. I know my around in Visual Studio but for web design I prefer some of the newer smart text editors (most notably Atom)","image":"vs.png"},{"name":"PHP","code":"php","type":"skill","description":"","category":"coding","image":"php.png"},{"name":"Advanced Installer","code":"ai","type":"tool","description":"","category":"tools","image":"ai.png"},{"name":"Websockets","code":"ws","type":"skill","enabled":"true","percentage":"90","category":"libraries","since":2015,"description":"I've used websockets to update chats, display user notifications, make sure forms are up-to-date and even programming little multi=player web games","image":"ws.png"},{"name":"Postman","code":"postman","type":"tool","enabled":"true","percentage":"85","category":"tools","since":2015,"description":"Postman has been instrumental in testing APIs. I can't actually imagine not using Postman to develop API's and integrations with other API's.","image":"postman.webp"},{"name":"VBA","code":"vba","type":"skill","enabled":"true","percentage":"90","since":2009,"description":"I've had extensive experience in writing functionality in MS Access databases and MS Excel sheets. Some of things I've done is import database data into excel and having it generate the spreadsheet with graphs, maintain a computer parts access database for warehouse use combined with a scanner to keep track of everything, did some freelance work with a furniture company that had extensive issues with their access database written by a coop, and even translated a whole access database from Vietnamese to English (without speaking Vietnamese, lol)","category":"coding","image":"vba.png"},{"name":"Visual Basic","code":"vb","type":"skill","description":"","image":"vb.png"},{"name":"MS Access","code":"access","type":"tool","description":"","image":"access.png"},{"name":"WK<html>TOpdf","code":"wkhtmltopdf","type":"tool","description":"","image":"wkhtmltopdf.png"},{"name":"Google Webmaster","code":"google","type":"tool","description":"","image":"googlewebmaster.png"},{"name":"PhoneGap","code":"phonegap","type":"tool","description":"","image":"phonegap.png"},{"name":"MS Partner","code":"mspartner","type":"skill","description":"","image":"mspartner.png"}]