[
  {
    "name": "AngularJS",
    "code": "angular",
    "type": "skill",
    "enabled":"true",
    "percentage":"80",
    "since":2015,
    "description": "AngularJS has quickly become my favourite front-end web app framework, so much so that I can't imagine ever creating another website without it (I haven't tried ReactJs yet however). In fact, this website relies heavily on AngularJS. The crown-jewel of my AngularJS experience is found at <a href='https://npgcloud.com' target='_blank'>https://npgcloud.com</a>, a web app where high profile customers such as Hudson Bay Company, 7-Eleven and Sprint go to design and print their name badges.",
    "tldr": "",
    "image": "angular.png"
  },
  {
    "name": "NodeJS",
    "code": "node",
    "type": "skill",
    "enabled":"true",
    "percentage":"80",
    "since":2015,
    "description": "I discovered Node and started learning its possibilities in June 2015. The simplicity to set up a running server with Node is quite frankly astonishing and the ease of adding community written plugins still amazes me on a daily basis. Currently I have 4 node apps running, 2 externally facing that have helped me automate various processes, including an app that made it possible to download software prevously only available via CD.<br>I've used a lot of plugins so far, the most notable ones would be: <ul><li><strong>Tedious</strong> To make SQL connections easy</li><li><strong>Sequelize</strong> To make SQL queries using JS syntax</li><li><strong>Mongoose</strong> To make
        query MongoDB</li><li><strong>IIS Node</strong> To run node apps in IIS</li><li><strong>Nodemailer</strong> Simple SMTP package to make mailing easy</li><li><strong>Gulp</strong> To make development a breeze</li></ul>A full mastery of Node is impossible; I learn new things every time I use it and I am eager to keep learning it.",
    "tldr": "",
    "image": "node.png"
  },
  {
    "name": "French",
    "code": "fr",
    "type": "language",
    "enabled":"true",
    "percentage":"75",
    "since":1992,
    "description": "Growing up in a small bilingual country with a non-common mother tongue, getting a second language is mandatory. By 12th grade we were required to read novels and do book reports on them, debate with classmates on various subjects and do an oral exam. Even though at the time it didn't seem like a great thing, I later landed a job for Nestle tech support (HP) in Dublin which only served French-speaking users while all my colleagues were also French. Crazily enough, I learned a vast amount of technical and colloquial French in an English speaking country. This skill comes in very handy in Canada as I can write manuals and user interfaces in both official languages (and which I am not a stranger too). Although I am getting rustier again at French due to not having used it in a while, it still comes in handy when a French-speaking customer is having trouble.",
    "tldr": "",
    "image": "france.png"
  },
  {
    "name": "Dutch",
    "code": "nl",
    "type": "language",
    "enabled":"true",
    "percentage":"100",
    "since":1988,
    "description": "Although my mother tongue is <a href='https://en.wikipedia.org/wiki/West_Flemish' target='_blank'>West-Flemish</a>, Dutch is basically a second mother tongue to me due to the closeness of the languages and having to speak Dutch to the rest of the Flemish and Dutch population so they could understand us. I've used this asset to translate software I've made that is sold to Dutch customers currently.",
    "tldr": "",
    "image": "netherlands.png"
  },
  {
    "name": "T-SQL",
    "code": "sql",
    "type": "skill",
    "enabled":"true",
    "percentage":"85",
    "since":2012,
    "description": "SQL Server is one of the environments I'm most comfortable in. I have been able to use SQL server to automate a plethora of processes saving countless hours of manual work and weeding out errors made by it: automating emailed orders, calling APIs to auto-process orders, getting form data from wordpress, adding tarriffed item counts to UPS labels, calculating US customs dues, sending packing slips to third party warehouses, auto-enrolling supply chain customers,.... I've received a substantial <strong>CEO award</strong> in 2015 for building a report that allowed users to correlate any 2 attributes of sales to show trending. I've set up a couple of SQL databases from scratch to use for various reasons: APIs, SSRS reporting cubes, Automated order processing and am savvy in creating all aspects of a new database (keys, procedures, functions, relationships, backups, jobs,...)",
    "tldr": "",
    "image": "sql.png"
  },
  {
    "name": "Sequelize",
    "code": "sequelize",
    "type": "tool",
    "enabled":"true",
    "percentage":"80",
    "since":2016,
    "description": "I first found Sequelize in the beginning of 2017 as I was searching for a tool to make SQL querying easier and making SQL injection hard. I stumbled upon Sequelize and have since implemented it in practically all my node apps. Since I'm know my way around SQL and I'm very accustomed to javascript syntax, this tool just married both into a fantastic tool to speed up all coding related to SQL.",
    "tldr": "",
    "image": "sequelize.png"
  },
  {
    "name": "MS ASP",
    "code": "asp",
    "type": "skill",
    "enabled":"true",
    "percentage":"65",
    "description": "My experience with ASP has mostly been making one page applications like <a href='http://nameprintgraphics.com/npgjava/bb' target='_blank'>Best Buy Badges</a> or building on existing ASP applications like <a href='http://registration.imprintplus.com' target='_blank'>the Logic Protect Registration server</a>. Although I favor Node and PHP, I'm capable of building ASP applications.",
    "since":2013,
    "image": "aspnet.png"
  },
  {
    "name": "JQuery",
    "code": "jquery",
    "type": "skill",
    "enabled":"true",
    "percentage":"100",
    "description": "There's really no starting any web development without JQuery from my point of view. Eliminating the verbose Document statements and adding easy css manipulations are a no-brainer. It's also very hard to be bad at JQuery since it's so easy to use. Anyway, if you're reading this, I'm sure I don't need to explain it any further.",
    "since":2012,
    "image": "jquery.png"
  },
  {
    "name": "Java",
    "code": "java",
    "type": "skill",
    "enabled":"true",
    "percentage":"65",
    "description": "My most extensive experiences with Java are my thesis in college <a href='http://simplegamenet.sourceforge.net' target='_blank'>SimpleGameNet</a> and doing bug fixes on <a href='http://nameprintgraphics.com' target='_blank'>NPG Web</a> (user: demo, password: imprint+). It was a no brainer for my thesis as the purpose was to make a gaming network to could run on different operating systems. I've worked with Netbeans and practically all java versions since 1.4. Java is undeniably due to it's cross-OS compatibility although I've left it a bit by the wayside due to my focus on web technologies and [web] Java support disappearing.",
    "tldr": "A bit rusty but worked with it closely",
    "since":2002,
    "image": "java.png"
  },
  {
    "name": "MySQL",
    "code": "mysql",
    "type": "skill",
    "enabled":"true",
    "percentage":"70",
    "description": "I haven't used MySQL a lot, only to link existing databases to SQL server databases and to check on data, but I haven't found it to be that different from SQL server which I can navigate very easily.",
    "image": "mysql.png"
  },
  {
    "name": "Certifications",
    "code": "certify",
    "type": "skill",
    "enabled":"true",
    "percentage":"85",
    "description": "I've certified a plethora of different software applications using various certificates: websites (Node and IIS), EXEs, MSIs, DLLs, JARs with PFX and EV certifications, self-signed or provided by Symantec.",
    "image": "certified.png"
  },
  {
    "name": "Google API",
    "code": "googleapi",
    "type": "skill",
    "enabled":"true",
    "percentage":"60",
    "description": "I've used the Google Developer Console to dynamically load Youtube videos, create smooth maps, add funky fonts, analyze visitor data and add recaptchas to sites. There is a vast amount of resources available there and I've just scratched the surface of them. Undoubtedly I will continue using Google's APIs.",
    "image": "redis.png"
  },
  {
    "name": "Redis",
    "code": "redis",
    "type": "skill",
    "description": "",
    "image": "redis.png"
  },
  {
    "name": "WordPress",
    "code": "wp",
    "type": "skill",
    "description": "",
    "image": "wordpress.png"
  },
  {
    "name": "MS IIS",
    "code": "iis",
    "type": "skill",
    "enabled":"true",
    "percentage":"75",
    "since":1999,
    "description": "I've maintained multiple different websites in IIS including a server which had PHP, ASP and Node (IIS Node) websites runnning concurrently. I'm no stranger to setting up SSL certificates, redirects, web.config files, APIs (WebDAV FTL) and managing the appropriate permissions for app pools and users. Although I have set up a bunch of sites already, there is still much to learn in IIS.",
    "tldr": "",
    "image": "iis.png"
  },
  {
    "name": "MongoDB",
    "code": "mongo",
    "type": "skill",
    "enabled":"true",
    "percentage":"85",
    "since":2015,
    "description": "Currently Mongo is the only No-SQL database language I've ever used (both the local installation administered with Robomongo and one hosted by Mongolab). I've used it together with Mongoose in node. Although I do see the benefits of fast data access with documents, I still prefer the robust nature of a SQL relational database. However, the speed at which you can set up a No-SQL database is my biggest draw.",
    "image": "mongodb.png"
  },
  {
    "name": "C++",
    "code": "c++",
    "type": "skill",
    "enabled":"true",
    "percentage":"55",
    "since":2000,
    "description": "Back in college I wrote C++ applications (2000-2003) but there was a hiatus of over a decade before I dove into it again by adding features and fixing bugs of an existing application. I wouldn't call myself an expert in C++ but having dived back into it, it has really shown that it is like riding a bike, give or take some maintenance.",
    "image": "c++.png"
  },
  {
    "name": "MS Dynamics CRM",
    "code": "crm",
    "type": "skill",
    "description": "",
    "image": "msdynamics.png"
  },
  {
    "name": "HTML5",
    "code": "html5",
    "type": "skill",
    "description": "",
    "image": "html5.png"
  },
  {
    "name": "Git",
    "code": "git",
    "type": "skill",
    "enabled":"true",
    "percentage":"85",
    "since":2015,
    "description": "I've worked with SVN before, but in my eyes, it is no match with Git. There simply is no project I will start without Git nowadays. I've used it to create repositories for all code at Imprint Plus (with Atlassian BitBucket) as previously the code was all over the place without a central location. I shall refer you to the link at the bottom of the page to my github account to get an idea!",
    "image": "git.png"
  },
  {
    "name": "Atom",
    "code": "atom",
    "type": "tool",
    "enabled":"true",
    "percentage":"100",
    "since":2015,
    "description": "My go-to text editor to code web apps in. The community-driven list of plugins is endless and it works like magic in conjunction with Git. Some plugins I particularly enjoyed are: <ul><li>minimap</li><li>linter</li><li>jshint</li><li>autoclose-html</li><li>pigments</li><li>highlight-selected</li></ul>",
    "image": "atom.png"
  },
  {
    "name": "Bootstrap",
    "code": "bootstrap",
    "type": "skill",
    "enabled":"true",
    "percentage":"95",
    "since":2012,
    "description": "It is undeniable how convenient and smooth Bootstrap is and how easily you can plop in different themes. If I have to make a quick web app or I'm making an elaborate website, bootstrap is the first thing in the resource folder. Clikc change theme in this website to see just how easy it is to switch.",
    "image": "bootstrap.png"
  },
  {
    "name": "Express",
    "code": "express",
    "type": "skill",
    "enabled":"true",
    "percentage":"95",
    "since":2015,
    "description": "My go to for building RESTful APIs, I haven't tried any others as Express always does what I ned it to do in a simple and comprehensible way.",
    "image": "express.png"
  },
  {
    "name": "RESTful API",
    "code": "api",
    "type": "skill",
    "enabled":"true",
    "percentage":"90",
    "since":2015,
    "description": "I already knew the usefulness of Restful APIs but when I started exploring the possiblities myself a proverbial whole new world opened up. I've built APIs for executables to be able to download templates, to send orders to remote warehouses, to process shopify orders, to analyze worpress data, build pdfs, monitor/log software activity... ",
    "image": "rest.png"
  },
  {
    "name": "Javascript",
    "code": "js",
    "type": "skill",
    "enabled":"true",
    "percentage":"85",
    "since":2001,
    "description": "Due to its ease of use, javascript is my go-to language for most solutions. I've used it to make easy URL builders, file matching, ftp transactions, dynamic intranet pages, CRM automation, search functions, online coding challenges, and numerous other things to quickly help out people. It is essential when making sites and combined with Node it truly becomes a powerhouse for which you only have to know one language.",
    "image": "js.png"
  },
  {
    "name": "Visual Studio",
    "code": "vs",
    "type": "tool",
    "enabled":"true",
    "percentage":"70",
    "since":2001,
    "description": "I've used Visual Studio for a long time for both SSRS reporting, C++ and Visual Basic programming projects. Like all Microsoft products, it is so feature rich that you can get lost in it easily. I know my around in Visual Studio but for web design I prefer some of the newer smart text editors (most notably Atom)",
    "image": "vs.png"
  },
  {
    "name": "PHP",
    "code": "php",
    "type": "skill",
    "description": "",
    "image": "php.png"
  },
  {
    "name": "Advanced Installer",
    "code": "ai",
    "type": "tool",
    "description": "",
    "image": "ai.png"
  },
  {
    "name": "Websockets",
    "code": "ws",
    "type": "skill",
    "enabled":"true",
    "percentage":"70",
    "since":2015,
    "description": "I've used websockets to create an online chat but having create that, I can see how useful it can be beyond just updating messages. I will explore this further when I get the chance.",
    "image": "ws.png"
  },
  {
    "name": "Visual Basic for Applications",
    "code": "vba",
    "type": "skill",
    "description": "",
    "image": "vba.png"
  },
  {
    "name": "Visual Basic",
    "code": "vb",
    "type": "skill",
    "description": "",
    "image": "vb.png"
  },
  {
    "name": "MS Access",
    "code": "access",
    "type": "tool",
    "description": "",
    "image": "access.png"
  },
  {
    "name": "WK<html>TOpdf",
    "code": "wkhtmltopdf",
    "type": "tool",
    "description": "",
    "image": "wkhtmltopdf.png"
  },
  {
    "name": "Google Webmaster",
    "code": "google",
    "type": "tool",
    "description": "",
    "image": "googlewebmaster.png"
  },
  {
    "name": "PhoneGap",
    "code": "phonegap",
    "type": "tool",
    "description": "",
    "image": "phonegap.png"
  },
  {
    "name": "MS Partner",
    "code": "mspartner",
    "type": "skill",
    "description": "",
    "image": "mspartner.png"
  }
]
